app/controllers/oauth_controller.rb

INSERT INTO `users` (`city`, `created_at`, `email`, `external_ids`, `first_name`, `last_name`, `photos`, `updated_at`) VALUES ('Hamburg', '2013-11-02 17:06:49', 'anne_hwi@hotmail.com', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nxing: Anne_Lamprecht\n', 'Anne', 'Lamprecht', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nxing: https://x1.xingassets.com/img/n/nobody_f.140x185.jpg\n', '2013-11-02 17:06:49')
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'anne_hwi@hotmail.com' ORDER BY `users`.`id` ASC LIMIT 1
---
  def callback
    request_token = OAuth::RequestToken.new(@consumer, session[:token], session[:secret])
    @access_token = request_token.get_access_token(:oauth_verifier => params[:oauth_verifier])

    result = @access_token.request(:get, "https://api.xing.com/v1/users/me")
    json = JSON(result.body)

    person = json['users'][0]
    user_created = false
    @user =  User.find_or_create_by_email( person['active_email']) do |user|