app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `updated_at` = '2013-11-02 21:53:00', `external_ids` = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nxing: Anne_Lamprecht\n', `photos` = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nxing: https://x1.xingassets.com/img/n/nobody_f.140x185.jpg\n' WHERE `users`.`id` = 1
---
  def update

    current_user

    @user = User.find(params[:id])
    @user.update_attributes(params[:user])

SELECT `interests`.* FROM `interests` INNER JOIN `interests_users` ON `interests`.`id` = `interests_users`.`interest_id` WHERE `interests_users`.`user_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    # show_id = rand(1..User.all.count) unless params[:id]

    @user = User.includes(:user_interests).find(params[:id])